{"utils":{"contact":"contact me","contactSaveSuccess":"copied to clipboard!","cv":"see my cv"},"heroSection":{"desc":"Hello! I'm Sobhan, a front-end developer with a love for the world of coding and web design. I love learning new things and creating interesting projects. In this section, I want to tell you a little more about my personal and work life","title":"Sobhan Expert <important>Next js</important> Developer And\nWeb Development Specialist"},"header":{"item":{"about":"About","contact":"Contact","experience":"Experience","home":"Home","projects":"Projects","skills":"Skills"},"search":{"hashtag":{"exper":"experiences","project":"projects","skills":"skills"},"placeholder":"search for"}},"social":{"github":{"desc":"On my GitHub page, you can access the code for various projects I've developed. This is a place where I share my experience and programming skills and I welcome your comments and feedback.","subtitle":"My projects on GitHub","title":"GIthub"},"instagram":{"desc":"On my Instagram account, you can take a look at my professional and personal life. From behind the scenes of projects to everyday moments, here you can see and follow different aspects of my life.","subtitle":"Follow me on Instagram","title":"Instagram"},"linkedin":{"desc":"In my LinkedIn profile, you can access my educational and professional background and learn about my achievements and experiences. Also, through this platform we can stay connected and expand our professional network.","subtitle":"Professional networking on LinkedIn","title":"LinkedIn"},"telegram":{"desc":"In my Telegram channel, you can find out about my latest news, articles and new projects. Also, you can easily contact me and ask your questions through private messages.","subtitle":"Connect with me on Telegram","title":"Telegram"}},"home":{"article":{"desc":"In this section, I share a collection of articles and my personal experiences in various fields of technology and software development. Each article is the result of my research, experiments and learnings in real projects. From new techniques and tools to challenges and solutions I've encountered along the way, here you can find my knowledge and insight to use in your career.","title":"Experience & Article"},"projects":{"desc":"In this section, I share a selection of my top projects that I have done over the years in various fields. Each project represents creativity, expertise and relentless effort to achieve outstanding results. From software design and development projects to research studies and technological innovations, this is the place where you can learn more about my achievements and experiences."},"technicalGrowth":{"desc":"In this section, you will see my steps and experiences in the path of technical development and software development. From starting education in network and software to learning different technologies and implementing various projects, every step I have taken has brought me closer to becoming a professional developer. I hope this path inspires you and you benefit from my experiences.","timeline":{"five":{"desc":"After the jobvision site clone project, I started to build my own site, which you are currently viewing. I am still learning popular and widely used packages and libraries and continue to develop my technical skills.","subtitle":"Building a personal site and continuing the learning path","title":"Personal site development and continued learning"},"four":{"desc":"In the summer of 2023, I decided to learn Figma and Sass intro and developed small projects using Figma and Sass designs. In December 2023, I started learning Next.js and its structure surprised me. I devoted a lot of time to learning it and developed the Jobvision site clone project as a full stack.","subtitle":"Designing and developing with Figma and Sass and entering the world of Next.js","title":"Learning Figma and Sass and developing new projects"},"one":{"desc":"In July 2021, I started my studies in the field of network and software at the vocational technical college. In March of the same year, I met the world of web design and started learning HTML and CSS, which were my first steps towards web development.","subtitle":"Professional technical education and the beginning of the journey in the web world","title":"Start studying and getting familiar with web design"},"three":{"desc":"In August 2022, I started learning React and completed the course in 11 days. Then I refactored my previous store project and learned about TypeScript. During this time, I got acquainted with various React packages and libraries and tried to use them in test projects. At the end of 2022, I started the jobvision site clone project with the aim of advanced filtering and building a management panel, and I used all my current knowledge.","subtitle":"Learning React and Typescript and developing advanced projects","title":"Getting to know React and TypeScript"},"two":{"desc":"After two months of learning HTML and CSS, I got to know JavaScript and by mid-summer I was learning and solving small JavaScript projects. Also, I worked as an intern in a small company from the conservatory and gained new experiences. During this time, I developed medium-scale projects, such as the design of a site for selling training courses.","subtitle":"Deep learning of JavaScript and hands-on experience in a small company","title":"Entering the world of JavaScript and internship"}},"title":"Technical Growth"}}}