{
  "utils": {
    "contact": "با من تماس بگیر",
    "contactSaveSuccess": "در کلیپ بورد کپی شد!",
    "seeMyCv": "رزومه من را ببینید",
    "soon": "به زودی"
  },
  "heroSection": {
    "desc": "سلام! من سبحان هستم، یک توسعه دهنده فرانت اند با عشق به دنیای برنامه نویسی و طراحی وب. من عاشق یادگیری چیزهای جدید و ایجاد پروژه های جالب هستم. در این قسمت می خواهم کمی بیشتر از زندگی شخصی و کاری خود بگویم",
    "title": "سبحان کارشناس Next js توسعه دهنده و\nمتخصص توسعه وب"
  },
  "header": {
    "item": {
      "about": "در باره",
      "contact": "مخاطب",
      "experience": "تجربه",
      "home": "صفحه اصلی",
      "projects": "پروژه ها",
      "skills": "مهارت ها"
    },
    "search": {
      "hashtag": { "experience": "تجربیات", "project": "پروژه ها", "skills": "مهارت ها" },
      "placeholder": "جستجو برای"
    }
  },
  "social": {
    "github": {
      "desc": "در صفحه GitHub من، می توانید به کد پروژه های مختلفی که توسعه داده ام دسترسی داشته باشید. اینجا جایی است که من تجربیات و مهارت های برنامه نویسی خود را در آن به اشتراک می گذارم و از نظرات و نظرات شما استقبال می کنم.",
      "subtitle": "پروژه های من در GitHub",
      "title": "GIthub"
    },
    "instagram": {
      "desc": "در اکانت اینستاگرام من می توانید نگاهی به زندگی حرفه ای و شخصی من بیندازید. از پشت صحنه پروژه ها تا لحظه های روزمره، در اینجا می توانید جنبه های مختلف زندگی من را ببینید و دنبال کنید.",
      "subtitle": "من را در اینستاگرام دنبال کنید",
      "title": "اینستاگرام"
    },
    "linkedin": {
      "desc": "در پروفایل لینکدین من، می توانید به سوابق تحصیلی و حرفه ای من دسترسی داشته باشید و از دستاوردها و تجربیات من مطلع شوید. همچنین، از طریق این پلتفرم می‌توانیم متصل بمانیم و شبکه حرفه‌ای خود را گسترش دهیم.",
      "subtitle": "شبکه سازی حرفه ای در لینکدین",
      "title": "لینکدین"
    },
    "telegram": {
      "desc": "در کانال تلگرام من می توانید از آخرین اخبار، مقالات و پروژه های جدید من مطلع شوید. همچنین می توانید به راحتی با من تماس بگیرید و سوالات خود را از طریق پیام خصوصی مطرح کنید.",
      "subtitle": "در تلگرام با من در ارتباط باشید",
      "title": "تلگرام"
    }
  },
  "home": {
    "article": {
      "desc": "در این بخش مجموعه ای از مقالات و تجربیات شخصی خود را در زمینه های مختلف فناوری و توسعه نرم افزار به اشتراک می گذارم. هر مقاله حاصل تحقیقات، آزمایش ها و آموخته های من در پروژه های واقعی است. از تکنیک‌ها و ابزارهای جدید گرفته تا چالش‌ها و راه‌حل‌هایی که در این مسیر با آن‌ها مواجه شده‌ام، در اینجا می‌توانید دانش و بینش من را برای استفاده در حرفه خود بیابید.",
      "title": "تجربه و مقاله"
    },
    "projects": {
      "desc": "در این بخش منتخبی از پروژه های برتر خود را که در طول سال ها در زمینه های مختلف انجام داده ام به اشتراک می گذارم. هر پروژه نشان دهنده خلاقیت، تخصص و تلاش بی وقفه برای دستیابی به نتایج برجسته است. از پروژه‌های طراحی و توسعه نرم‌افزار گرفته تا مطالعات تحقیقاتی و نوآوری‌های تکنولوژیکی، اینجا مکانی است که می‌توانید درباره دستاوردها و تجربیات من اطلاعات بیشتری کسب کنید."
    },
    "technicalGrowth": {
      "desc": "در این قسمت مراحل و تجربیات من در مسیر توسعه فنی و توسعه نرم افزار را مشاهده خواهید کرد. از شروع آموزش در زمینه شبکه و نرم افزار تا یادگیری فناوری های مختلف و اجرای پروژه های مختلف، هر قدمی که برداشته ام مرا به یک توسعه دهنده حرفه ای نزدیک کرده است. امیدوارم این مسیر الهام بخش شما باشد و از تجربیات من بهره مند شوید.",
      "timeline": {
        "one": {
          "desc": "در تیرماه 1399 تحصیلاتم را در رشته شبکه و نرم افزار در دانشکده فنی حرفه ای آغاز کردم. در اسفند ماه همان سال با دنیای طراحی وب آشنا شدم و شروع به یادگیری HTML و CSS کردم که اولین قدم های من برای توسعه وب بود.",
          "subtitle": "آموزش فنی حرفه ای و آغاز سفر در دنیای وب",
          "title": "شروع به مطالعه و آشنایی با طراحی وب کنید"
        },
        "two": {
          "desc": "پس از دو ماه یادگیری HTML و CSS، با جاوا اسکریپت آشنا شدم و تا اواسط تابستان مشغول یادگیری و حل پروژه های کوچک جاوا اسکریپت بودم. همچنین به عنوان کارآموز در یک شرکت کوچک از هنرستان کار کردم و تجربیات جدیدی کسب کردم. در این مدت پروژه های متوسطی مانند طراحی سایت فروش دوره های آموزشی را توسعه دادم.",
          "subtitle": "یادگیری عمیق جاوا اسکریپت و تجربه عملی در یک شرکت کوچک",
          "title": "ورود به دنیای جاوا اسکریپت و کارآموزی"
        },
        "three": {
          "desc": "در مرداد 1401، یادگیری React را شروع کردم و دوره را در 11 روز به پایان رساندم. سپس پروژه فروشگاه قبلی خود را بازسازی کردم و در مورد TypeScript یاد گرفتم. در این مدت با بسته ها و کتابخانه های مختلف React آشنا شدم و سعی کردم از آنها در پروژه های آزمایشی استفاده کنم. در پایان سال 1401 پروژه کلون سایت jobvision را با هدف فیلترینگ پیشرفته و ساخت پنل مدیریتی شروع کردم و از تمام دانش فعلی خود استفاده کردم.",
          "subtitle": "یادگیری React و Typescript و توسعه پروژه های پیشرفته",
          "title": "آشنایی با React و TypeScript"
        },
        "four": {
          "desc": "در تابستان 1402، تصمیم گرفتم مقدمه Figma و Sass را یاد بگیرم و پروژه های کوچکی را با استفاده از طرح های Figma و Sass توسعه دادم. در آذر 1402، من شروع به یادگیری Next.js کردم و ساختار آن مرا شگفت زده کرد. من زمان زیادی را به یادگیری آن اختصاص دادم و پروژه شبیه سازی سایت Jobvision را به صورت Full Stack توسعه دادم.",
          "subtitle": "طراحی و توسعه با Figma و Sass و ورود به دنیای Next.js",
          "title": "یادگیری Figma و Sass و توسعه پروژه های جدید"
        },
        "five": {
          "desc": "بعد از پروژه کلون سایت jobvision شروع به ساخت سایت خودم کردم که شما هم اکنون در حال مشاهده آن هستید. من هنوز در حال یادگیری بسته ها و کتابخانه های محبوب و پرکاربرد هستم و به توسعه مهارت های فنی خود ادامه می دهم.",
          "subtitle": "ساخت سایت شخصی و ادامه مسیر یادگیری",
          "title": "توسعه سایت شخصی و یادگیری مداوم"
        }
      },
      "title": "رشد فنی"
    }
  },
  "about": {
    "title": "در باره من",
    "desc": "بخش درباره من وب‌سایت من به شما این امکان را می‌دهد تا بیشتر با من و مهارت‌هایم آشنا شوید. من سبحان یعقوبی هستم، یک برنامه‌نویس Front-End با تخصص و علاقه به طراحی و توسعه وب‌سایت‌های کاربرپسند و خلاقانه. هدف من همیشه ایجاد تجربه‌های دیجیتال جذاب و کارآمد برای کاربران است",
    "buttons": {
      "download": "دانلود رزومه",
      "readOnline": "مشاهده آنلاین"
    },
    "me": {
      "title": "نگاهی به زندگی من",
      "desc": "از سال 1400 علاقه‌مند به حوزه‌ی Front-End شدم و به صورت تخصصی این مسیر را ادامه می‌دهم. با گذراندن دوره‌های مختلف و کسب مهارت‌های متنوع، توانستم پروژه‌های متعددی را با موفقیت به انجام برسانم و همواره به دنبال یادگیری و بهبود دانش خود هستم <br/><br/> به باشگاه می‌روم و برای خودم وقت می‌گذارم تا سلامت جسمی و روحی خود را حفظ کنم. همچنین، به یادگیری پکیج‌های جدیدتر و کامل کردن Road Map فرانت‌اند مشغول هستم که این فعالیت‌ها به من کمک می‌کنند تا خلاقیت و توانایی‌های خود را افزایش دهم پد <br/><br/> در حوزه کاری، تمرکزم بر روی طراحی و توسعه وب‌سایت‌های کاربرپسند و تعاملی است. با استفاده از تکنولوژی‌های مدرن مانند HTML، CSS، JavaScript و فریم‌ورک‌هایی مانند React و Next.js، پروژه‌های متعددی را با کیفیت بالا به انجام رسانده‌ام. تجربه کار با تیم‌های مختلف و همکاری در پروژه‌های پیچیده به من این امکان را داده است تا مهارت‌های ارتباطی و مدیریتی خود را بهبود بخشم و به موفقیت‌های بیشتری دست یابم"
    }
  }
}
